; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite6 - satellite
	instrument15 - instrument
	infrared1 - mode
	image0 - mode
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Star1 - direction
	GroundStation3 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star4)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star5)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument8 image0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star2)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(supports instrument9 image0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star4)
	(supports instrument10 infrared1)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 infrared1)
	(supports instrument11 image0)
	(calibration_target instrument11 Star5)
	(calibration_target instrument11 Star2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument12 infrared1)
	(supports instrument12 image0)
	(calibration_target instrument12 Star4)
	(calibration_target instrument12 Star1)
	(supports instrument13 infrared1)
	(calibration_target instrument13 GroundStation3)
	(supports instrument14 infrared1)
	(supports instrument14 image0)
	(calibration_target instrument14 Star5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon9)
	(supports instrument15 infrared1)
	(supports instrument15 image0)
	(calibration_target instrument15 GroundStation3)
	(calibration_target instrument15 Star1)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet11)
)
(:goal (and
	(pointing satellite2 Planet11)
	(pointing satellite4 Star1)
	(have_image Planet6 image0)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 image0)
	(have_image Phenomenon9 infrared1)
	(have_image Star10 image0)
	(have_image Planet11 image0)
))

)

; plan
1. (turn_to satellite4 star1 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star1)
   goals met: 1 of 8
2. (turn_to satellite2 star2 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star2)
   goals met: 1 of 8
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 8
4. (calibrate satellite2 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 1 of 8
5. (turn_to satellite2 planet6 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet6)
   goals met: 1 of 8
6. (take_image satellite2 planet6 instrument5 image0)
   added: (have_image planet6 image0)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon9 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 8
8. (take_image satellite2 phenomenon9 instrument5 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 3 of 8
9. (turn_to satellite2 phenomenon7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon7)
   goals met: 3 of 8
10. (take_image satellite2 phenomenon7 instrument5 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 4 of 8
11. (turn_to satellite2 planet8 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet8)
   goals met: 4 of 8
12. (take_image satellite2 planet8 instrument5 image0)
   added: (have_image planet8 image0)
   goals met: 5 of 8
13. (turn_to satellite2 star10 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star10)
   goals met: 5 of 8
14. (take_image satellite2 star10 instrument5 image0)
   added: (have_image star10 image0)
   goals met: 6 of 8
15. (turn_to satellite2 planet11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet11)
   goals met: 7 of 8
16. (take_image satellite2 planet11 instrument5 image0)
   added: (have_image planet11 image0)
   goals met: 8 of 8
